package hw3;

import java.util.Scanner;

public class Hw3Task6 {
    //Використовуючи оператор switch написати програму, яка виводить на консоль посилання для завантаження
    // програми. З вибору програм взяти: IntelliJ IDEA, Git, Java. З вибору ОС взяти: Linux, MacOS, Windows.
    // Програма повинна запитати користувача, яка програма йому цікава, також запитати яку ОС він використовує,
    //а після вивести в консоль необхідне посилання. Якщо програма з такою назвою не виводить повідомлення
    // в консоль, про те, що такої програми не існує. Якщо зазначеної користувачем ОС немає, виводиться
    // повідомлення в консоль, що такої ОС немає.
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        System.out.println("Яка програма Вас цікавить??");
        String prog = sc.nextLine();
        switch (prog.toLowerCase()){}
    }
}
