package hw10.task1;

public class Main {
    public static void main(String[] args) {
        //Написати метод, який виводитиме на консоль інформацію про назву магазину, в якому відбувається
        // покупка, про вартість даної покупки. Про ім'я продавця, який продає товар, про ім'я покупця,
        // який купує товар, назву товару та вік покупця.
        //• Продавець може бути чесним чи ні.
        //• Якщо він чесний і товар є алкогольним, тоді він не продасть даний товар покупцю.
        //• Якщо він нечесний і товар є алкогольним, тоді він продасть даний товар покупцю.
        //• Якщо покупець має знижкову картку, то ціна покупки буде знижена на 10 відсотків.
        //• Усі поля класів мають бути приватними.
        //• Метод покупки належить самому магазину.
        //• Властивість чесності належить лише продавцеві.
        //• Тільки покупець може мати карту знижки.
        Shop shop = new Shop("АТБ");
        Seller seller = new Seller("Оля", true);
        Buyer buyer = new Buyer("Віталій", 19, true);
        Item item = new Item("Віскі", true, 450);
        shop.returnCost(seller, buyer, item);


        System.out.println("&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&");
        Shop shop1 = new Shop("Supermarket");
        Buyer buyer1 = new Buyer("Олег", 15, false);
        Seller seller1 = new Seller("Валентина", false);
        Item item1 = new Item("Вино", true, 250);
        shop1.returnCost(seller1, buyer1, item1);
    }
}
